Revit 2026 API

# SpatialElementFromToCalculationPointsMakeToPositionAcceptable Method

---

This function takes a potential "to" point and converts it to be a similar point on the opposite side of the family's host from the "from" point if necessary.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ MakeToPositionAcceptable(
	XYZ newToLocation
)
```
```vb
Public Function MakeToPositionAcceptable (
	newToLocation As XYZ
) As XYZ
```
```cpp
public:
XYZ^ MakeToPositionAcceptable(
	XYZ^ newToLocation
)
```
```fsharp
member MakeToPositionAcceptable :
        newToLocation : XYZ -> XYZ
```

#### Parameters

newToLocation XYZ
     The desired "to" location

#### Return Value

XYZ The valid "to" location.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the point is already an acceptable "to" location then the original point will be returned. Otherwise, the point's X and Y will be projected onto the centerline of the family's host.

#### Reference

SpatialElementFromToCalculationPoints Class

Autodesk.Revit.DB Namespace